tutorials/verificationAndValidation/axisymmetricHemispherical/sim/meshIndependence/medium/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [1 -1 -2 0 0];

internalField   uniform $initialP;

boundaryField
{
    "bodySide|bodyTop|side"
    {
        type    fixedFluxPressure;
    }

    inlet
    {
        type    fixedFluxPressure;
    }

    outlet
    {
        type    fixedValue;
        value   $internalField;
    }

    "symmYMin|symmZMin"
    {
        type    symmetry;
    }
}

// ************************************************************************* //
